In [2]:
import mysql.connector

# Replace with your own database credentials
config = {
    'user': 'root',
    'password': 'root',
    'host': 'localhost',
    'database': 'debi'
}

# Establish a connection to the database
try:
    connection = mysql.connector.connect(**config)
    if connection.is_connected():
        print("Successfully connected to the database")
except mysql.connector.Error as err:
    print(f"Error: {err}")

Successfully connected to the database

In [4]:
cursor = connection.cursor()
cursor.execute("SHOW TABLES")
for d in cursor:
	print(d)

('customer',)
('data',)
('datetime_practice',)
('employee',)
('first_five',)
('info',)
('mobile',)
('mobile_data',)
('salaries',)
('salaries_names',)
('salary',)

ORDER BY

In [3]:
cursor.execute("SELECT * FROM mobile_data WHERE id<=5")
for d in cursor:
    print(d)

(0, 1, 1043, 1, 1.8, 1, 14, 0, 5, 0.1, 193, 3, 16, 226, 1412, 3476, 12, 7, 2, 0, 1, 0)
(1, 2, 841, 1, 0.5, 1, 4, 1, 61, 0.8, 191, 5, 12, 746, 857, 3895, 6, 0, 7, 1, 0, 0)
(2, 3, 1807, 1, 2.8, 0, 1, 0, 27, 0.9, 186, 3, 4, 1270, 1366, 2396, 17, 10, 10, 0, 1, 1)
(3, 4, 1546, 0, 0.5, 1, 18, 1, 25, 0.5, 96, 8, 20, 295, 1752, 3893, 10, 0, 7, 1, 1, 0)
(4, 5, 1434, 0, 1.4, 0, 11, 1, 49, 0.5, 108, 6, 18, 749, 810, 1773, 15, 8, 7, 1, 0, 1)

In [4]:
cursor.execute("SELECT * FROM mobile_data WHERE id<=5 ORDER BY battery_power ASC")
for d in cursor:
    print(d)

(1, 2, 841, 1, 0.5, 1, 4, 1, 61, 0.8, 191, 5, 12, 746, 857, 3895, 6, 0, 7, 1, 0, 0)
(0, 1, 1043, 1, 1.8, 1, 14, 0, 5, 0.1, 193, 3, 16, 226, 1412, 3476, 12, 7, 2, 0, 1, 0)
(4, 5, 1434, 0, 1.4, 0, 11, 1, 49, 0.5, 108, 6, 18, 749, 810, 1773, 15, 8, 7, 1, 0, 1)
(3, 4, 1546, 0, 0.5, 1, 18, 1, 25, 0.5, 96, 8, 20, 295, 1752, 3893, 10, 0, 7, 1, 1, 0)
(2, 3, 1807, 1, 2.8, 0, 1, 0, 27, 0.9, 186, 3, 4, 1270, 1366, 2396, 17, 10, 10, 0, 1, 1)

In [21]:
cursor.execute("SELECT * FROM mobile_data WHERE id<=5 ORDER BY battery_power ASC , clock_speed DESC")
for d in cursor:
    print(d)

(1, 2, 841, 1, 0.5, 1, 4, 1, 61, 0.8, 191, 5, 12, 746, 857, 3895, 6, 0, 7, 1, 0, 0)
(0, 1, 1043, 1, 1.8, 1, 14, 0, 5, 0.1, 193, 3, 16, 226, 1412, 3476, 12, 7, 2, 0, 1, 0)
(4, 5, 1434, 0, 1.4, 0, 11, 1, 49, 0.5, 108, 6, 18, 749, 810, 1773, 15, 8, 7, 1, 0, 1)
(3, 4, 1546, 0, 0.5, 1, 18, 1, 25, 0.5, 96, 8, 20, 295, 1752, 3893, 10, 0, 7, 1, 1, 0)
(2, 3, 1807, 1, 2.8, 0, 1, 0, 27, 0.9, 186, 3, 4, 1270, 1366, 2396, 17, 10, 10, 0, 1, 1)

In [7]:
# Create the first table
cursor.execute("""
CREATE TABLE IF NOT EXISTS info (
    id INT PRIMARY KEY,
    name VARCHAR(255),
    age INT
)
""")

# Create the second table
cursor.execute("""
CREATE TABLE IF NOT EXISTS salaries (
    id INT PRIMARY KEY,
    name VARCHAR(255),
    salary INT
)
""")

# Commit the changes
connection.commit()

print("Tables created successfully")

Tables created successfully

In [8]:
# Insert data into the info table
cursor.execute("""
INSERT INTO info (id, name, age) VALUES
(1, 'Alice', 25),
(2, 'Bob', 30),
(3, 'Charlie', 35)
""")

# Insert data into the salaries table
cursor.execute("""
INSERT INTO salaries (id, name, salary) VALUES
(1, 'Alice', 50000),
(2, 'Bob', 60000),
(3, 'Charlie', 70000)
""")

# Commit the changes
connection.commit()

print("Data inserted successfully")

IntegrityError: 1062 (23000): Duplicate entry '1' for key 'info.PRIMARY'

In [7]:
# Insert data into the info table
cursor.execute("""
INSERT INTO info (id, name, age) VALUES
(4, 'Khaled', 25)
""")

# Insert data into the salaries table
cursor.execute("""
INSERT INTO salaries (id, name, salary) VALUES
(6, 'Hassan', 50000)
""")

# Commit the changes
connection.commit()

print("Data inserted successfully")

Data inserted successfully

In [9]:
cursor.execute("SELECT * FROM info")
for d in cursor:
    print(d)

(1, 'Alice', 25)
(2, 'Bob', 30)
(3, 'Charlie', 35)
(4, 'Khaled', 25)

Inner Join

In [16]:
cursor.execute("SELECT * FROM info INNER JOIN salaries ON info.id = salaries.id")
for d in cursor:
    print(d)

(1, 'Alice', 25, 1, 'Alice', 50000)
(2, 'Bob', 30, 2, 'Bob', 60000)
(3, 'Charlie', 35, 3, 'Charlie', 70000)

In [17]:
cursor.execute("SELECT info.name,info.age,salaries.salary FROM info INNER JOIN salaries ON info.id = salaries.id")
for d in cursor:
    print(d)

('Alice', 25, 50000)
('Bob', 30, 60000)
('Charlie', 35, 70000)

In [20]:
cursor.execute("""
               SELECT i.name,i.age,s.salary 
               FROM info i
               INNER JOIN salaries s
               ON i.id = s.id
               """)
for d in cursor:
    print(d)

('Alice', 25, 50000)
('Bob', 30, 60000)
('Charlie', 35, 70000)

Outer Join

In [21]:
# LEFT JOIN
cursor.execute("""
               SELECT i.name,i.age,s.salary 
               FROM info i
               LEFT JOIN salaries s
               ON i.id = s.id
               """)
for d in cursor:
    print(d)

('Alice', 25, 50000)
('Bob', 30, 60000)
('Charlie', 35, 70000)
('Khaled', 25, None)

In [11]:
# RIGHT JOIN
cursor.execute("""
               SELECT s.name,i.age,s.salary 
               FROM info i
               RIGHT JOIN salaries s
               ON i.id = s.id
               """)
for d in cursor:
    print(d)

('Alice', 25, 50000)
('Bob', 30, 60000)
('Charlie', 35, 70000)
('Hassan', None, 50000)

In [40]:
# FULL OUTER JOIN
cursor.execute("""
                SELECT i.name, i.age , s.salary
                FROM info i
                LEFT JOIN salaries s ON i.id = s.id

                UNION DISTINCT

                SELECT s.name, i.age , s.salary
                FROM info i
                RIGHT JOIN salaries s ON i.id = s.id
               """)
for d in cursor:
    print(d)

('Alice', 25, 50000)
('Bob', 30, 60000)
('Charlie', 35, 70000)
('Khaled', 25, None)
('Hassan', None, 50000)

In [12]:
# Differnce between Two tables on Right
cursor.execute("""
                SELECT s.name, i.age , s.salary
                FROM info i
                RIGHT JOIN salaries s ON i.id = s.id
                WHERE i.id IS NULL
               """)
for d in cursor:
    print(d)

('Hassan', None, 50000)

In [13]:
# Differnce between Two tables on Left
cursor.execute("""
                SELECT i.name, i.age , s.salary
                FROM info i
                LEFT JOIN salaries s ON i.id = s.id
                WHERE s.id IS NULL
               """)
for d in cursor:
    print(d)

('Khaled', 25, None)

In [21]:
# Differnce between Two tables on Left
cursor.execute("""
                SELECT i.name, i.age , s.salary
                FROM info i
                LEFT JOIN salaries s ON i.id = s.id
                WHERE i.id IS NULL OR s.id IS NULL

                UNION DISTINCT

                SELECT s.name, i.age , s.salary
                FROM info i
                RIGHT JOIN salaries s ON i.id = s.id
                WHERE i.id IS NULL OR s.id IS NULL
               """)
for d in cursor:
    print(d)

('Khaled', 25, None)
('Hassan', None, 50000)

Aggregate functions

In [42]:
cursor.execute("""
SELECT COUNT(*)
FROM info
""")

for d in cursor:
    print(d)

(4,)

In [44]:
cursor.execute("""
SELECT MAX(s.salary) , MIN(s.salary) , AVG(s.salary)
                FROM info i
                INNER JOIN salaries s ON i.id = s.id
""")

for d in cursor:
    print(d)

(70000, 50000, Decimal('60000.0000'))

GROUP BY

In [6]:
# Create the Customer table
cursor.execute("""
CREATE TABLE IF NOT EXISTS Customer (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(255),
    ContactName VARCHAR(255),
    Address VARCHAR(255),
    City VARCHAR(255),
    PostalCode VARCHAR(20),
    Country VARCHAR(50)
)
""")

# Insert data into the Customer table
# cursor.execute("""
# INSERT INTO Customer (CustomerID, CustomerName, ContactName, Address, City, PostalCode, Country) VALUES
# (1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
# (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico'),
# (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico'),
# (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
# (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
# """)

# Commit the changes
connection.commit()

print("Data inserted successfully")

Data inserted successfully

In [9]:
cursor.execute("""
SELECT Country,COUNT(CustomerID)
FROM Customer
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC

""")

for d in cursor:
    print(d)

('Mexico', 2)
('Germany', 1)
('UK', 1)
('Sweden', 1)